#coding=utf-8
import time

def lz():
    t = time.time()
    for i in xrange(10000):
        s = '兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州' +'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰 州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+ '兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰> 州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'+'兰州'
    print time.time() - t

lz()

def jo():
    t = time.time()
    s = ''.join(['李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超','李超'])
    print time.time() -t 

jo()
